<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5cb28f3d164015ad772d292a7fdf069266d391ef7f39920905b67069792a5df2","plan_job_ref":"Job Dev Terraform Plan #12 at https://github.com/mattspahr-hashi/tf-adoption-scaffolding/actions/runs/10600799495","plan_out_hash":"dc11c58b803607e94d665dff4ee676ab117e136805a898c1fefbc7f65eb1ee87","plan_hash":"091fe617a118ceed0f64ab6d927cfa48db6f658c38111a32398904b7d4446a12","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __.__
With backend config: `backend_s3_dev.conf`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_instance.web_server will be created
+   resource "aws_instance" "web_server" {
+       ami                                  = "ami-09e5a7cd9561f8ea9"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = [
+           "web-server-sg",
        ]
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "web-server1"
        }
+       tags_all                             = {
+           "Name" = "web-server1"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "aeb1ade1407f8991c54c0e4ff6bbdc88936dcdbf"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       maintenance_options (known after apply)

+       metadata_options (known after apply)

+       network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)
    }

  # aws_security_group.web-server-sg will be created
+   resource "aws_security_group" "web-server-sg" {
+       arn                    = (known after apply)
+       description            = "Allow HTTP from Anywhere"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
#                (1 unchanged attribute hidden)
            },
        ]
+       name                   = "web-server-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "web-server-sg"
        }
+       tags_all               = {
+           "Name" = "web-server-sg"
        }
+       vpc_id                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Dev Terraform Plan #12](https://github.com/mattspahr-hashi/tf-adoption-scaffolding/actions/runs/10600799495)